home/public_html/org_mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-21 Wed 13:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes for org-mode</title>
<meta name="author" content="Alex" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
             href="./css/fb.css" type="text/css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Notes for org-mode</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9cf511f">1. shortcuts</a></li>
<li><a href="#orge755e57">2. Math/Latex</a>
<ul>
<li><a href="#orgc5942d2">2.1. superscript/subscript, square root</a></li>
<li><a href="#orged9c1c7">2.2. Matix</a></li>
<li><a href="#orgfd0e27e">2.3. '\|' for ||</a></li>
</ul>
</li>
<li><a href="#org9ae125a">3. work with images on Windows</a></li>
</ul>
</div>
</div>


<div id="outline-container-org9cf511f" class="outline-2">
<h2 id="org9cf511f"><span class="section-number-2">1.</span> shortcuts</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>C-c C-x \ : runs the command org-toggle-pretty-entities</li>
</ul>
</div>
</div>

<div id="outline-container-orge755e57" class="outline-2">
<h2 id="orge755e57"><span class="section-number-2">2.</span> Math/Latex</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc5942d2" class="outline-3">
<h3 id="orgc5942d2"><span class="section-number-3">2.1.</span> superscript/subscript, square root</h3>
<div class="outline-text-3" id="text-2-1">
<p>
If \(a^2=b\) and \( b=2 \), then the solution must be
either \[ a=+\sqrt{2} \] or \[ a=-\sqrt{2} \].
</p>
</div>
</div>

<div id="outline-container-orged9c1c7" class="outline-3">
<h3 id="orged9c1c7"><span class="section-number-3">2.2.</span> Matix</h3>
<div class="outline-text-3" id="text-2-2">
\begin{matrix}
 a & b \\
 c & d \\
\end{matrix}

\begin{pmatrix} 
  \alpha     & \beta^{*}\\ 
  \gamma^{*} & \delta 
\end{pmatrix}

\begin{bmatrix} 
  \alpha     & \beta^{*}\\ 
  \gamma^{*} & \delta 
\end{bmatrix}


<p>
\(X =
\begin{array}{cc}
x & y \\
z & w \\
\end{array}\)
</p>


<p>
\(M = \left( \begin{smallmatrix} a&b\\ c&d \end{smallmatrix} \right)\)
</p>

<ul class="org-ul">
<li>matrix: unbracketed matrix</li>
<li>pmatrix: matrix surrounded by parentheses</li>
<li>bmatrix: matrix surrounded by square brackets</li>
<li>vmatrix: matrix surrounded by single vertical lines</li>
<li>Vmatrix: matrix surrounded by double vertical lines</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd0e27e" class="outline-3">
<h3 id="orgfd0e27e"><span class="section-number-3">2.3.</span> '\|' for ||</h3>
<div class="outline-text-3" id="text-2-3">
<p>
\(\|a\|\)<sup>2</sup> = a * a
</p>
</div>
</div>
</div>

<div id="outline-container-org9ae125a" class="outline-2">
<h2 id="org9ae125a"><span class="section-number-2">3.</span> work with images on Windows</h2>
<div class="outline-text-2" id="text-3">
<pre class="example" id="org9b2e6c1">

I'm glad to hear that it's working now! Besides adding the debugging messages, the main changes I made to the function were:

1. **Escaping Backslashes**: Ensuring that backslashes in file paths are properly escaped. This is important for Windows file paths in Emacs Lisp. For example, I replaced `/` with `\\` in the `replace-regexp-in-string` function.

2. **Concatenation of Strings**: Making sure that the `concat` function is used correctly to concatenate strings, especially when constructing the `filename` and the command string.

Here is the revised function with the changes highlighted:

```elisp
(defun org-screenshot ()
  "Take a screenshot into a time stamped unique-named file in the same 
directory as the org-buffer and insert
a link to this file."
  (interactive)
  (create-directory-if-not-exists org-download-image-dir)

  (setq tilde-buffer-filename
        (replace-regexp-in-string "/" "\\\\" (buffer-file-name) t t)) ;; Escaping backslashes
  (setq filename
        (concat
         (make-temp-name
          (concat org-download-image-dir
                  "_"
                  (format-time-string "%Y%m%d_%H%M%S_"))) ".jpg")) ;; Correct concatenation
  ;; Debugging: Print the filename to the *Messages* buffer
  (message "Saving screenshot to: %s" filename)

  ;; Linux: ImageMagick: (call-process "import" nil nil nil filename)

  ;; (shell-command "powershell.exe snippingtool /clip")
  (my-org-download-set-dir)
  (org-download-screenshot)
  ;; Windows: Irfanview
  (let ((command (concat "C:\\Users\\axu\\bin\\iview467_x64\\i_view64.exe /clippaste /convert=\"" filename "\""))) ;; Correct concatenation
    ;; Debugging: Print the command to the *Messages* buffer
    (message "Executing command: %s" command)
    (call-process-shell-command command))
  (insert (concat "[[file:" filename "]]"))
  (org-display-inline-images))
```

These changes ensure that the file paths are correctly formatted and that the command to save the image is constructed properly. If you have any more questions or need further assistance, feel free to ask!
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex</p>
<p class="date">Created: 2024-08-21 Wed 13:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
